package com.grishiya.BreathFreeBot.botResponse.services.start;


import com.grishiya.BreathFreeBot.botResponse.model.Page;
import org.springframework.stereotype.Service;

import java.util.Arrays;
import java.util.List;
@Service
public class WelcomePageService {

    private List<Page> pages = Arrays.asList(
            new Page("legkiyStart1.jpeg",
                    "Кхе-кхе-кхе… Привет, мы твои лёгкие. \uD83E\uDE78 \n\n" +
                            "Ты, наверное, редко о нас думаешь. Но мы всегда рядом. \n" +
                            "Каждый день мы работаем, чтобы ты мог жить, дышать, смеяться. \uD83D\uDE04 \n\n" +
                            "Мы рады, что ты пришёл! Правда, последнее время нам стало тяжело... \n\n" +
                            "Ты слышишь этот кашель? \uD83E\uDD7A \n" +
                            "Это мы... Мы хотим поговорить с тобой. \n\n" +
                            "Можешь уделить нам немного времени?"),

            new Page("legkieStart3.jpeg",
                    "Ты не видишь нас. Но внутри нас – смолы, яд... \uD83D\uDCA8 \n" +
                            "Кислород уходит всё медленнее... \n\n" +
                            "Каждый раз, когда в нас попадает дым, мы сжимаемся. \n" +
                            "Наши клетки разрушаются. Нам становится сложнее работать. \uD83E\uDD7A \n\n" +
                            "Но мы не виним тебя. Мы знаем, что ты сильный. \uD83C\uDFC6 \n" +
                            "И мы знаем, что ты можешь помочь нам. Вопрос только в одном... \n\n" +
                            "Ты готов хотя бы узнать, как можно нас спасти?"),

            new Page("legkieStart2.jpeg",
                    "Мы узнали, что можно бросить курить **без страха, без боли и без мучений.** \n\n" +
                            "Ты можешь оставить жизнь, зависимую от никотина, в прошлом. \uD83C\uDF1F \n" +
                            "Легко и естественно – и даже **не чувствовать тягу!** \n\n" +
                            "Мы готовы рассказать тебе всё, что знаем. Мы уверены, что ты справишься. \uD83D\uDCAA \n" +
                            "Просто доверься нам."),

            new Page("legkieStart4.jpeg",
                    "Мы знаем, что нужно делать, чтобы спастись. \uD83C\uDFC3\u200D♂️ \n\n" +
                            "Всё, что тебе нужно, чтобы стать свободным – **уже здесь**. \n" +
                            "Ты **не один**. Мы знаем, что делать, и мы готовы помочь тебе. \n\n" +
                            "Ты **ничего не потеряешь**, если просто познакомишься с тем, что мы подготовили для тебя. \n" +
                            "Мы будем рядом, будем поддерживать тебя на всём пути. \uD83D\uDCAA \n\n" +
                            "Но перед тем как начать… \n" +
                            "Нам важно знать, как к тебе обращаться. \n\n" +
                            "Как тебя зовут? \uD83D\uDC68\u200D\uD83C\uDF93")
    );
    public Page getPage(int index) {
        return pages.get(index);
    }
    public int getTotalPages() {
        return pages.size();
    }
}
