package com.grishiya.BreathFreeBot.botResponse.handlers.stateHandlers.stateHandlersImpl.Begin;

public class TextForBegin {
    public static final String FIRST_MESSAGE = """
            ✨ Всё, что тебе нужно – уже здесь. В этом боте.  

            Бот будет помогать тебе на каждом этапе,на всем твоем пути.
            Тебе будет лего и просто 😊

            Здесь ты встретишь:

            ✅ *Поддержку* – мы будем рядом в самые сложные моменты.  
            ✅ *Напоминания* – бот поможет соблюдать план отказа.  
            ✅ *Полезные материалы* – ты узнаешь, как избавиться от тяги.  
            ✅ *Достижения* – твои успехи будут зафиксированы.  
            ✅ *Мотивация* – ты увидишь, как меняется твоя жизнь.  

            В дальнейшем мы подробно расскажем как это будет работать вместе,
            И ты прочувствуешь всю мощь этого бота на себе 😁
                            Продолжим? """;

    private final String MESSAGE="!";
//📌 *Но главное – это осознание!*
//Ты не просто бросаешь курить, ты начинаешь понимать:
//- *Почему ты курил все эти годы?*
//- *Что на самом деле происходит в момент, когда ты закуриваешь?*
//- *Почему кажется, что бросить трудно, хотя это не так?*
//- *Что происходит с твоим телом, сознанием и психикой при отказе?*
//
//💡 *Именно осознание даёт свободу! Бросить курить — не испытание, а путь к пониманию себя.*
//
//🚀 *А чтобы сделать этот процесс максимально лёгким и эффективным, мы рекомендуем использовать сразу оба метода:*
//
//🔹 *Метод Аллена Карра* – *«Лёгкий способ бросить курить»* – способ, который помог миллионам людей по всему миру и разрушает мифы о курении.
//🔹 *Дополнительная поддержка с цитизином* – натуральным веществом, которое уменьшает никотиновую зависимость и облегчает переход к жизни без сигарет.
//
//⚠ *Эти методы работают вместе! Не стоит выбирать что-то одно — их сила в сочетании.*
//Ты не просто бросаешь, ты полностью освобождаешься!
//
//💪 *Мы будем рядом на каждом этапе, помогая тебе понять, почувствовать и пройти этот путь легко.*
//Ты уже сделал первый шаг – теперь просто следуй за нами. 🚀😊
//"""
//
}