package com.grishiya.BreathFreeBot.botResponse.handlers.stateHandlers.stateHandlersImpl.userSmokingInfo;

public class TextForSIH {
    public static String textForDuration = """
✨ *Перед тем как мы продолжим знакомиться с возможностями бота, давай сначала познакомимся с твоей привычкой.

☝ Важно понимать свою зависимость, чтобы осознать, как освободиться от неё.
Привычка формируется не за один день.
Она становится частью жизни, и человек часто даже не задумывается, когда именно всё началось.


🧘 Давай начнём с честного взгляда на себя. Это важный шаг к свободе.
✊ Выбери вариант ниже, который тебе подходит.
""";
}
